# DoesBarExistAtPosition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..DoesBarExistAtPosition Method
RebarContainerItem Class See Also
---
Checks whether a bar exists at the specified position.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool DoesBarExistAtPosition(
	int barPosition
)
```

Visual Basic
---
```text
Public Function DoesBarExistAtPosition ( _
	barPosition As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool DoesBarExistAtPosition(
	int barPosition
)
```

# ### Parameters
barPosition
    Type: System..::..Int32 A bar position index between 0 and NumberOfBarPositions-1.
# Remarks
Returns true, unless the bar position is the first or last in the set and it is suppressed by IncludeFirstBar or IncludeLastBar.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | barPosition is not in the range [ 0, NumberOfBarPositions-1 ]. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace